<?php

return [
    'comments_mode' => [
        'public' => '',
        'consumer' => 'امکان نظر دهی برای این محصول صرفا برای خریداران آن مجاز است',
        'deactive' => 'امکان نظر دهی برای این محصول غیر فعال است'
    ],
    'vote_mode' => [
        'public' => '',
        'consumer' => 'امکان امتیاز دهی برای این محصول صرفا برای خریداران آن مجاز است',
        'deactive' => 'امکان امتیاز دهی برای این محصول غیر فعال است'
    ],
    'set_options' => [
        'success_message' => 'تنظیمات مدنظر باموفقیت به ثبت رسید',
        'failed_message' => 'ثبت تنظیمات با اختلال مواجه شد',
    ],
    'insert_comment' => [
        'success_message' => 'نظر شما باموفقیت به ثبت رسید',
        'product_visibility_failed' => 'این محصول ناموجود یا در وضعیت غیرفعال است',
        'review_consumer_failed' => 'ثبت نظر و یا امتیاز دهی به این محصول صرفا برای خریداران آن مجاز است',
        'review_deactive_failed' => 'ثبت نظر و یا امتیاز دهی به این محصول در وضعیت غیرفعال قرار دارد',
    ],
    'review' => [
        'update_success' => 'تغییر وضعیت نظر قبت شده، با موفقیت انجام شد',
        'update_failed' => 'تغییر وضعیت نظر قبت شده، با اختلال مواجه شد',
    ]
];
